{
  "header": "S čím umím pracovat",
  "second-header": "Preferuji Front-end",
  "text": "Jsem kreativní a matematicky založený člověk, což znamená, že mě baví jak frontend, tak backend. Díky své empatické povaze rozumím i UI/UX. Jednoduše se snažím, aby aplikace byly co nejméně komplikované a plnily stoprocentně svůj účel.",
  "ui-header": "UI a Grafika",
  "figma": "Figmu znám opravdu dobře a často ji používám.",
  "photoshop": "Používal jsem v minulosti. Díky drahým placeným plánům dnes již nepoužívam.",
  "procreate": "Levná a plně dostačující náhrada Photoshopu. Používám nejčastěji ke kreslení a úpravě obrázků.",
  "html": "Prostě základ, který je potřeba umět.",
  "tailwind": "Skvělý CSS framework. Zjednodušuje kód a zvyšuje performance.",
  "react": "React jsem si vybral díky jeho rozsáhle komunitě, ekosystému a jednoduchosti.",
  "next": "Webové aplikace dnes vytvářím zásadně pomocí Next.js. Jednoduchost a výkon Next.js mě jednoduše ohromily.",
  "react-native": "Pro mobilní aplikace používám React Native.",
  "swift": "Znám základy Swiftu a umím v něm udělat jednoduché aplikace.",
  "electron": "Když je potřeba desktopovou aplikaci, rozšířím React o Electron.js.",
  "node": "Znám základy. Hlouběji zatím nebyl důvod jít. Snad se důvod v budoucnu najde.",
  "express": "Jednoduchý framework pro Node.js, který dokáže usnadnit život.",
  "python": "Na Pythonu jsem začínal. Rád ho používám.",
  "db-header": "Databáze",
  "mongo": "MongoDB mám velmi rád, zejména díky možnosti vytvářet serverless backend.",
  "drizzle": "Skvělé řešení pro Next.js.",
  "npm-header": "Npm knihovny",
  "npm": "Toto je mých top 5 oblíbených npm knihoven:",
  "axios": "Používám takřka vždy pro HTTP requesty.",
  "react-query": "Usnadňuje práci s data fetchingem.",
  "framer-motion": "Tuto knihovnu používám pro animace a najdete ji takřka ve všech mých projektech.",
  "swiper": "Výborná knihovna pro slidery.",
  "three": "Tuto knihovnu velmi obdivuji, ale s 3D grafikou mám jen základní zkušenosti.",
  "other-header": "Ostatní",
  "git": "Klíčový nástroj pro verzování, spolupráci a správu kódu.",
  "postman": "Usnadňují mi život při testování a práci s API.",
  "docker": "Znám pouze základy Dockeru, používám ho velmi výjimečně.",
  "vitest": "Používám pro psaní testů."
}
