{
  "header": "What I can work with",
  "second-header": "I prefer Front-end",
  "text": "I am a creative and mathematically oriented person, which means I enjoy both frontend and backend development. Thanks to my empathetic nature, I also understand UI/UX. I simply strive to make applications as uncomplicated as possible and ensure they fulfill their purpose one hundred percent.",
  "ui-header": "UI and Graphics",
  "figma": "I am very familiar with Figma and use it frequently.",
  "photoshop": "I used it in the past. Due to the expensive paid plans, I no longer use it today.",
  "procreate": "A cheap and fully sufficient replacement for Photoshop. I use it most often for drawing and editing images.",
  "html": "Simply a fundamental skill that needs to be mastered.",
  "react": "I chose React because of its large community, ecosystem, and simplicity.",
  "next": "Today, I primarily create web applications using Next.js. The simplicity and performance of Next.js have simply amazed me.",
  "react-native": "For mobile applications, I use React Native.",
  "electron": "When a desktop application is needed, I extend React with Electron.js.",
  "node": "I know the basics. So far, there hasn't been a reason to go deeper. Hopefully, a reason will arise in the future.",
  "express": "A simple framework for Node.js that can make life easier.",
  "python": "I started with Python. I like using it.",
  "db-header": "Databases",
  "mongo": "I really like MongoDB, especially for the ability to create a serverless backend.",
  "drizzle": "A great solution for Next.js.",
  "npm-header": "Npm Libraries",
  "npm": "I have experience with so many npm libraries that listing them would be too long. Thanks to these experiences, I can quickly learn to work with a new library that I don't know yet.",
  "other-header": "Others",
  "git": "A key tool for versioning, collaboration, and code management.",
  "postman": "Makes my life easier when testing and working with APIs.",
  "docker": "I only know the basics of Docker, and I use it very rarely.",
  "vitest": "Using for writing tests."
}
